# Домашнее задание по теме: MySQL

## Подготовка

Установка `MySQL Community Server` + `MySQL Workbench`:

- [MySQL Community Server](https://dev.mysql.com/downloads/mysql/)
    
- [MySQL Workbench](https://dev.mysql.com/downloads/workbench/)

In [1]:
# ВНИМАНИЕ: необходимо удостовериться, что виртуальная среда выбрана правильно!

# для Linux
!which pip

# для Windows
!pip -V

/home/efremenkov/anaconda3/envs/data_scientist_levelup/bin/pip
pip 20.3.3 from /home/efremenkov/anaconda3/envs/data_scientist_levelup/lib/python3.8/site-packages/pip (python 3.8)

In [3]:
# установка необходимых пакетов
!conda install pandas -y

Collecting package metadata (current_repodata.json): done
Solving environment: done

## Package Plan ##

  environment location: /home/efremenkov/anaconda3/envs/data_scientist_levelup

  added / updated specs:
    - pandas


The following packages will be downloaded:

    package                    |            build
    ---------------------------|-----------------
    pandas-1.2.1               |   py38ha9443f7_0         8.9 MB
    pytz-2021.1                |     pyhd3eb1b0_0         181 KB
    ------------------------------------------------------------
                                           Total:         9.0 MB

The following NEW packages will be INSTALLED:

  blas               pkgs/main/linux-64::blas-1.0-mkl
  intel-openmp       pkgs/main/linux-64::intel-openmp-2020.2-254
  mkl                pkgs/main/linux-64::mkl-2020.2-256
  mkl-service        pkgs/main/linux-64::mkl-service-2.3.0-py38he904b0f_0
  mkl_fft            pkgs/main/linux-64::mkl_fft-1.2.0-py38h23d657b_0
  mkl_random         pkgs/main/linux-64::mkl_random-1.1.1-py38h0573a6f_0
  numpy              pkgs/main/linux-64::numpy-1.19.2-py38h54aff64_0
  numpy-base         pkgs/main/linux-64::numpy-base-1.19.2-py38hfa32c7d_0
  pandas             pkgs/main/linux-64::pandas-1.2.1-py38ha9443f7_0
  pytz               pkgs/main/noarch::pytz-2021.1-pyhd3eb1b0_0



Downloading and Extracting Packages
pandas-1.2.1         | 8.9 MB    | ##################################### | 100%
pytz-2021.1          | 181 KB    | ##################################### | 100%
Preparing transaction: done
Verifying transaction: done
Executing transaction: done

In [4]:
# импорт необходимых пакетов
import pandas as pd    # пакет для работы с таблицами

from sqlalchemy import create_engine

import sqlalchemy
sqlalchemy.__version__

'1.3.23'

In [7]:
# данные для подключения к серверу MySQL
user='root'
password='docker'
host='localhost'
port='3306'

In [8]:
# подключение к серверу MySQL (engine)
engine=create_engine(f"mysql+pymysql://{user}:{password}@{host}:{port}")
engine

Engine(mysql+pymysql://root:***@localhost:3306)

## ERR Model

<img src="images/eer_model_hw.png"/>

## Создание БД

In [74]:
db_name="store"
with engine.connect() as connection:
    connection.execute(f'drop database if exists {db_name}')
    connection.execute(f'create database {db_name}')
    connection.execute(f'use {db_name}')

## Создание таблиц

In [75]:
# items
with engine.connect() as connection:
    connection.execute("""create table items (
    id int unsigned not null auto_increment,
    name varchar(50) not null,
    type enum('men', 'women', 'uni') not null,
    manufacture_date date not null,
    primary key(id)
    )""")

In [76]:
# categories
with engine.connect() as connection:
    connection.execute("""create table categories (
    id int unsigned not null auto_increment,
    name varchar(30) not null,
    primary key(id)
    )""")

In [77]:
# prices
with engine.connect() as connection:
    connection.execute("""create table prices (
    item_id int unsigned not null,
    price float not null,
    foreign key(item_id)
    references items(id)
    on update cascade
    on delete cascade)
    """)

In [78]:
# items_categories
with engine.connect() as connection:
    connection.execute("""create table items_categories (
    category_id int unsigned not null,
    item_id int unsigned not null,
    foreign key(category_id)
    references categories(id)
    on update cascade
    on delete cascade,
    foreign key(item_id)
    references items(id)
    on update cascade
    on delete cascade)
    """)

## Заполнение таблиц

(Самостоятельно придумать данные для заполнения, это не имеет значения. 5-15 значений в каждой таблице)

In [79]:
# items
with engine.connect() as connection:
    connection.execute("""insert into items (name, type, manufacture_date) values 
    ('Slim Fit Cargo joggers', 'men', '2020-01-23'),
    ('Sweatpants Regular Fit', 'men', '2020-06-01'),
    ('Nylon cargo trousers', 'men', '2021-02-10'),
    ('Cotton leggings', 'women', '2020-05-08'),
    ('Denim carpenter dungarees', 'women', '2020-03-03'),
    ('Wide twill trousers', 'women', '2020-11-12'),
    ('Twill shirt jacket', 'men', '2021-01-09'),
    ('Wool-blend shirt jacket', 'men', '2021-06-14'),
    ('Cotton flannel shirt', 'men', '2020-02-11'),
    ('V-neck blouse', 'women', '2020-09-01'),
    ('Patterned blouse', 'women', '2019-12-01'),
    ('Felt hat', 'uni', '2020-08-11'),
    ('Knitted tube scarf', 'uni', '2021-01-01'),
    ('Small backpack', 'uni', '2020-09-06')
    """)

In [80]:
# categories
with engine.connect() as connection: 
    connection.execute("""insert into categories (name) values 
    ('trousers'),
    ('shirt'),
    ('accessories')
    """)

In [81]:
# prices
with engine.connect() as connection: 
    connection.execute("""insert into prices (item_id, price) values 
    ('1', '14.2'),
    ('2', '9.5'),
    ('3', '23.7'),
    ('5', '34.2'),
    ('6', '53.6'),
    ('7', '15.1'),
    ('8', '18'),
    ('10', '52.1'),
    ('12', '18.6'),
    ('13', '15'),
    ('14', '19.2')
    """)

In [82]:
# items_categories
with engine.connect() as connection: 
    connection.execute("""insert into items_categories (category_id, item_id) values 
    ('1', '1'),
    ('1', '2'),
    ('1', '3'),
    ('1', '4'),
    ('1', '5'),
    ('1', '6'),
    ('2', '7'),
    ('2', '8'),
    ('2', '9'),
    ('2', '10'),
    ('2', '11'),
    ('3', '12'),
    ('3', '13'),
    ('3', '14')
    """)

## Проверка заполнения таблиц

(Вывести данные, которые были записаны в таблицы)

In [83]:
# items
items_df = pd.read_sql_query("""select * from items""", engine)
items_df

    id                       name   type manufacture_date
0    1     Slim Fit Cargo joggers    men       2020-01-23
1    2     Sweatpants Regular Fit    men       2020-06-01
2    3       Nylon cargo trousers    men       2021-02-10
3    4            Cotton leggings  women       2020-05-08
4    5  Denim carpenter dungarees  women       2020-03-03
5    6        Wide twill trousers  women       2020-11-12
6    7         Twill shirt jacket    men       2021-01-09
7    8    Wool-blend shirt jacket    men       2021-06-14
8    9       Cotton flannel shirt    men       2020-02-11
9   10              V-neck blouse  women       2020-09-01
10  11           Patterned blouse  women       2019-12-01
11  12                   Felt hat    uni       2020-08-11
12  13         Knitted tube scarf    uni       2021-01-01
13  14             Small backpack    uni       2020-09-06

In [84]:
# categories
categories_df = pd.read_sql_query("""select * from categories""", engine)
categories_df

   id         name
0   1     trousers
1   2        shirt
2   3  accessories

In [85]:
# prices
prices_df = pd.read_sql_query("""select * from prices""", engine)
prices_df

    item_id  price
0         1   14.2
1         2    9.5
2         3   23.7
3         5   34.2
4         6   53.6
5         7   15.1
6         8   18.0
7        10   52.1
8        12   18.6
9        13   15.0
10       14   19.2

In [86]:
# items_categories
items_categories_df = pd.read_sql_query("""select * from items_categories""", engine)
items_categories_df

    category_id  item_id
0             1        1
1             1        2
2             1        3
3             1        4
4             1        5
5             1        6
6             2        7
7             2        8
8             2        9
9             2       10
10            2       11
11            3       12
12            3       13
13            3       14

## Обновление данных

In [87]:
# изменить одно наименование (name) товара
with engine.connect() as connection: 
    connection.execute("""update items 
    set name = 'Cotton joggers'
    where id = 4
    """)

In [88]:
# проверить, что наименование изменилось
cotton_joggers_df = pd.read_sql_query("""select * from items where id = 4""", engine)
cotton_joggers_df

   id            name   type manufacture_date
0   4  Cotton joggers  women       2020-05-08

## Удаление данных

In [89]:
# удалить один товар с условием
with engine.connect() as connection: 
    connection.execute("""delete from items where id = 7
    """)

In [90]:
# проверить, что наименование товар был удален из таблицы items
items_df = pd.read_sql_query("""select * from items""", engine)
items_df

    id                       name   type manufacture_date
0    1     Slim Fit Cargo joggers    men       2020-01-23
1    2     Sweatpants Regular Fit    men       2020-06-01
2    3       Nylon cargo trousers    men       2021-02-10
3    4             Cotton joggers  women       2020-05-08
4    5  Denim carpenter dungarees  women       2020-03-03
5    6        Wide twill trousers  women       2020-11-12
6    8    Wool-blend shirt jacket    men       2021-06-14
7    9       Cotton flannel shirt    men       2020-02-11
8   10              V-neck blouse  women       2020-09-01
9   11           Patterned blouse  women       2019-12-01
10  12                   Felt hat    uni       2020-08-11
11  13         Knitted tube scarf    uni       2021-01-01
12  14             Small backpack    uni       2020-09-06

In [91]:
# проверить, что наименование товар был удален из таблицы items_categories
items_categories_df = pd.read_sql_query("""select * from items_categories""", engine)
items_categories_df

    category_id  item_id
0             1        1
1             1        2
2             1        3
3             1        4
4             1        5
5             1        6
6             2        8
7             2        9
8             2       10
9             2       11
10            3       12
11            3       13
12            3       14

In [92]:
# проверить, что наименование товар был удален из таблицы prices
prices_df = pd.read_sql_query("""select * from prices""", engine)
prices_df

   item_id  price
0        1   14.2
1        2    9.5
2        3   23.7
3        5   34.2
4        6   53.6
5        8   18.0
6       10   52.1
7       12   18.6
8       13   15.0
9       14   19.2

## ERR Model

<img src="images/eer_model_hw.png"/>

## Получение данных (с условиями)

In [93]:
n = None # выбрать n
# вывести все данные из таблицы prices, где price больше n
prices_df = pd.read_sql_query("""select * from prices where price > 10.1""", engine)
prices_df

   item_id  price
0        1   14.2
1        3   23.7
2        5   34.2
3        6   53.6
4        8   18.0
5       10   52.1
6       12   18.6
7       13   15.0
8       14   19.2

In [94]:
n = None # выбрать n
nid = None # выбрать nid
# вывести все данные из таблицы prices, где price больше n И item_id не равен nid
prices_df = pd.read_sql_query("""select * from prices where price > 15.0 and item_id <> 10""", engine)
prices_df

   item_id  price
0        3   23.7
1        5   34.2
2        6   53.6
3        8   18.0
4       12   18.6
5       14   19.2

In [95]:
first_syms = None # выбрать символы (буква или несколько букв)
# вывести все данные из таблицы items, где name начинается с first_syms
cotton_items_df = pd.read_sql_query("""select * from items where name like 'Cotton%%'""", engine)
cotton_items_df

   id                  name   type manufacture_date
0   4        Cotton joggers  women       2020-05-08
1   9  Cotton flannel shirt    men       2020-02-11

In [96]:
last_sym = None # выбрать символ (буква)
item_type = None # выбрать тип

# объединить (union) результаты запросов (повторения допускаются):
# name, type из items, где name заканчивается символом last_sym
# name, type из items, где type равен item_type
union_df = pd.read_sql_query("""select * from items where name like '%%ers'
                                union all
                                select * from items where type = 'women'""", engine)
union_df

   id                       name   type manufacture_date
0   1     Slim Fit Cargo joggers    men       2020-01-23
1   3       Nylon cargo trousers    men       2021-02-10
2   4             Cotton joggers  women       2020-05-08
3   6        Wide twill trousers  women       2020-11-12
4   5  Denim carpenter dungarees  women       2020-03-03
5  10              V-neck blouse  women       2020-09-01
6  11           Patterned blouse  women       2019-12-01

In [102]:
# вывести name, type из items и price из prices
# указывать только товары содержащие цены и не должно быть цен без товаров
inner_join_df = pd.read_sql_query("""select i.name, i.type, p.price from items i 
                                join prices p on p.item_id = i.id
                                """, engine)
inner_join_df

                        name   type  price
0     Slim Fit Cargo joggers    men   14.2
1     Sweatpants Regular Fit    men    9.5
2       Nylon cargo trousers    men   23.7
3  Denim carpenter dungarees  women   34.2
4        Wide twill trousers  women   53.6
5    Wool-blend shirt jacket    men   18.0
6              V-neck blouse  women   52.1
7                   Felt hat    uni   18.6
8         Knitted tube scarf    uni   15.0
9             Small backpack    uni   19.2

In [103]:
# вывести name, type из items и price из prices
# могут быть товары, у которых нет цены
left_join_df = pd.read_sql_query("""select i.name, i.type, p.price from items i 
                                left join prices p on p.item_id = i.id
                                """, engine)
left_join_df

                         name   type  price
0      Slim Fit Cargo joggers    men   14.2
1      Sweatpants Regular Fit    men    9.5
2        Nylon cargo trousers    men   23.7
3              Cotton joggers  women    NaN
4   Denim carpenter dungarees  women   34.2
5         Wide twill trousers  women   53.6
6     Wool-blend shirt jacket    men   18.0
7        Cotton flannel shirt    men    NaN
8               V-neck blouse  women   52.1
9            Patterned blouse  women    NaN
10                   Felt hat    uni   18.6
11         Knitted tube scarf    uni   15.0
12             Small backpack    uni   19.2

In [104]:
# получить среднюю цену
average_price_df = pd.read_sql_query("""select avg(price) from prices""", engine)
average_price_df

   avg(price)
0       25.81

In [107]:
# получить id товаров и цену для товаров, у которых цена < средней цены
items_df = pd.read_sql_query("""select item_id, price from prices
                                where price < (select avg(price) from prices)""", engine)
items_df

   item_id  price
0        1   14.2
1        2    9.5
2        3   23.7
3        8   18.0
4       12   18.6
5       13   15.0
6       14   19.2